Revit 2024 API
BuiltInFailures.JoinElementsFailures.CannotJoinElementsStructuralError Property
 Can't keep elements joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotJoinElementsStructuralError { get; }
Visual Basic
Public Shared ReadOnly Property CannotJoinElementsStructuralError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotJoinElementsStructuralError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace